
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 16 to change, 7 to destroy.</code></pre>

* Create
  * module.database[0].azurerm_postgresql_active_directory_administrator.admin
  * module.database[0].azurerm_postgresql_database.postgres-db
  * module.database[0].azurerm_postgresql_server.postgres-paas
  * module.database[0].azurerm_private_endpoint.postgres[0]
  * module.database[0].azurerm_resource_group.data-resourcegroup
  * module.database[0].null_resource.set-user-permissions[0]
  * module.database[0].random_password.password
* Update
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
  * azurerm_key_vault_secret.sdp-database
  * azurerm_key_vault_secret.sdp-database-flexible
  * azurerm_key_vault_secret.sdp-host
  * azurerm_key_vault_secret.sdp-host-flexible
  * azurerm_key_vault_secret.sdp-port
  * azurerm_key_vault_secret.sdp-port-flexible
  * azurerm_key_vault_secret.secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.secret[&#34;USER&#34;]
* Delete
  * module.database.azurerm_postgresql_active_directory_administrator.admin
  * module.database.azurerm_postgresql_database.postgres-db
  * module.database.azurerm_postgresql_server.postgres-paas
  * module.database.azurerm_private_endpoint.postgres[0]
  * module.database.azurerm_resource_group.data-resourcegroup
  * module.database.null_resource.set-user-permissions[0]
  * module.database.random_password.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-FLEXIBLE-DATABASE/a488df034fcd4fb5b1c0dd8419fa9d32"
        name                    = "account-management-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-FLEXIBLE-HOST/2fda2f3320e649b28bbaa27457d7b25f"
        name                    = "account-management-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-FLEXIBLE-PASS/079f62847b2040e2bb57475cf96ab219"
        name                    = "account-management-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-FLEXIBLE-PORT/abf10b35129d4428b7108f616dae6cec"
        name                    = "account-management-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-FLEXIBLE-USER/2655fc2c75e94e549d19337152ffc7ae"
        name                    = "account-management-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-database will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-database" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-DATABASE/c97a1b08f6954efda1a16a0c6dad823a"
        name                    = "account-management-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-database-flexible will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-database-flexible" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-FLEXIBLE-DATABASE/15b276b23b5b40d1842c3cdff0e1d399"
        name                    = "account-management-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-host will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-host" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-HOST/46764aa9925749a487505cfcfa8f929b"
        name                    = "account-management-POSTGRES-HOST"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-host-flexible will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-host-flexible" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-FLEXIBLE-HOST/1e9ebf1b0cc1485ab9be8559a122b5bd"
        name                    = "account-management-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-port will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-port" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-PORT/4c200b3100d3422d9080f55523497219"
        name                    = "account-management-POSTGRES-PORT"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-port-flexible will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-port-flexible" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-FLEXIBLE-PORT/417c375eb2ef49c8878c2e7a498685ad"
        name                    = "account-management-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-DATABASE/8ce251ec48bd4777a94507a628072ef9"
        name                    = "account-management-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-HOST/813d16b2426144869c81ffef9b220709"
        name                    = "account-management-POSTGRES-HOST"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-PASS/5a50d60698da4b259be4d0a6865cc58d"
        name                    = "account-management-POSTGRES-PASS"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-PORT/a1035a13a62042d29439c00331f8644b"
        name                    = "account-management-POSTGRES-PORT"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-11-01T13:34:22Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/account-management-POSTGRES-USER/750355f593714144ab8626cf65a5a8ad"
        name                    = "account-management-POSTGRES-USER"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "account-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # module.database.azurerm_postgresql_active_directory_administrator.admin will be destroyed
  # (because module.database is not in configuration)
  - resource "azurerm_postgresql_active_directory_administrator" "admin" {
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-account-management-data-staging/providers/Microsoft.DBforPostgreSQL/servers/pip-account-management-staging" -> null
      - login               = "DTS Platform Operations" -> null
      - object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - resource_group_name = "pip-account-management-data-staging" -> null
      - server_name         = "pip-account-management-staging" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.database.azurerm_postgresql_database.postgres-db will be destroyed
  # (because module.database is not in configuration)
  - resource "azurerm_postgresql_database" "postgres-db" {
      - charset             = "UTF8" -> null
      - collation           = "en-GB" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-account-management-data-staging/providers/Microsoft.DBforPostgreSQL/servers/pip-account-management-staging/databases/accountmanagement" -> null
      - name                = "accountmanagement" -> null
      - resource_group_name = "pip-account-management-data-staging" -> null
      - server_name         = "pip-account-management-staging" -> null
    }

  # module.database.azurerm_postgresql_server.postgres-paas will be destroyed
  # (because module.database is not in configuration)
  - resource "azurerm_postgresql_server" "postgres-paas" {
      - administrator_login               = "accountmanagement_user" -> null
      - administrator_login_password      = (sensitive value) -> null
      - auto_grow_enabled                 = true -> null
      - backup_retention_days             = 35 -> null
      - create_mode                       = "Default" -> null
      - fqdn                              = "pip-account-management-staging.postgres.database.azure.com" -> null
      - geo_redundant_backup_enabled      = true -> null
      - id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-account-management-data-staging/providers/Microsoft.DBforPostgreSQL/servers/pip-account-management-staging" -> null
      - infrastructure_encryption_enabled = false -> null
      - location                          = "uksouth" -> null
      - name                              = "pip-account-management-staging" -> null
      - public_network_access_enabled     = false -> null
      - resource_group_name               = "pip-account-management-data-staging" -> null
      - sku_name                          = "GP_Gen5_2" -> null
      - ssl_enforcement_enabled           = true -> null
      - ssl_minimal_tls_version_enforced  = "TLS1_2" -> null
      - storage_mb                        = 51200 -> null
      - tags                              = {
          - "application"         = "publishing-information-service"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#publishing-and-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Publishing Information Project"
        } -> null
      - version                           = "11" -> null

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = false -> null
          - email_addresses      = [] -> null
          - enabled              = true -> null
          - retention_days       = 0 -> null
        }
    }

  # module.database.azurerm_private_endpoint.postgres[0] will be destroyed
  # (because module.database is not in configuration)
  - resource "azurerm_private_endpoint" "postgres" {
      - custom_dns_configs       = [] -> null
      - id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-account-management-data-staging/providers/Microsoft.Network/privateEndpoints/pip-staging-endpoint" -> null
      - location                 = "uksouth" -> null
      - name                     = "pip-staging-endpoint" -> null
      - network_interface        = [
          - {
              - id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-account-management-data-staging/providers/Microsoft.Network/networkInterfaces/pip-staging-endpoint.nic.1e67b12c-88b1-4fdb-9dfa-9eb37b8ef99c"
              - name = "pip-staging-endpoint.nic.1e67b12c-88b1-4fdb-9dfa-9eb37b8ef99c"
            },
        ] -> null
      - private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-account-management-data-staging/providers/Microsoft.Network/privateEndpoints/pip-staging-endpoint/privateDnsZoneGroups/postgres-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.postgres.database.azure.com"
              - name                = "privatelink.postgres.database.azure.com"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com"
              - record_sets         = [
                  - {
                      - fqdn         = "pip-account-management-staging.privatelink.postgres.database.azure.com"
                      - ip_addresses = [
                          - "10.148.32.13",
                        ]
                      - name         = "pip-account-management-staging"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name      = "pip-account-management-data-staging" -> null
      - subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/iaas" -> null
      - tags                     = {
          - "application"         = "publishing-information-service"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#publishing-and-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Publishing Information Project"
        } -> null

      - private_dns_zone_group {
          - id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-account-management-data-staging/providers/Microsoft.Network/privateEndpoints/pip-staging-endpoint/privateDnsZoneGroups/postgres-endpoint-dnszonegroup" -> null
          - name                 = "postgres-endpoint-dnszonegroup" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection           = false -> null
          - name                           = "pip-staging-db" -> null
          - private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-account-management-data-staging/providers/Microsoft.DBforPostgreSQL/servers/pip-account-management-staging" -> null
          - private_ip_address             = "10.148.32.13" -> null
          - subresource_names              = [
              - "postgresqlServer",
            ] -> null
        }
    }

  # module.database.azurerm_resource_group.data-resourcegroup will be destroyed
  # (because module.database is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-account-management-data-staging" -> null
      - location = "uksouth" -> null
      - name     = "pip-account-management-data-staging" -> null
      - tags     = {
          - "application"         = "publishing-information-service"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#publishing-and-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Publishing Information Project"
        } -> null
    }

  # module.database.null_resource.set-user-permissions[0] will be destroyed
  # (because module.database is not in configuration)
  - resource "null_resource" "set-user-permissions" {
      - id       = "8710091761513516235" -> null
      - triggers = {
          - "db_reader_user" = "DTS SDS DB Access Reader"
          - "name"           = "pip-account-management"
          - "script_hash"    = "f6e30acec7d742bb8de09d51ea3724cedb22a597c641336ed4f8aecd58283229"
        } -> null
    }

  # module.database.random_password.password will be destroyed
  # (because module.database is not in configuration)
  - resource "random_password" "password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # module.database[0].azurerm_postgresql_active_directory_administrator.admin will be created
  + resource "azurerm_postgresql_active_directory_administrator" "admin" {
      + id                  = (known after apply)
      + login               = "DTS Platform Operations"
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + resource_group_name = "pip-account-management-data-staging"
      + server_name         = "pip-account-management-staging"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.database[0].azurerm_postgresql_database.postgres-db will be created
  + resource "azurerm_postgresql_database" "postgres-db" {
      + charset             = "utf8"
      + collation           = "en-GB"
      + id                  = (known after apply)
      + name                = "accountmanagement"
      + resource_group_name = "pip-account-management-data-staging"
      + server_name         = "pip-account-management-staging"
    }

  # module.database[0].azurerm_postgresql_server.postgres-paas will be created
  + resource "azurerm_postgresql_server" "postgres-paas" {
      + administrator_login              = "accountmanagement_user"
      + administrator_login_password     = (sensitive value)
      + auto_grow_enabled                = true
      + backup_retention_days            = 35
      + create_mode                      = "Default"
      + fqdn                             = (known after apply)
      + geo_redundant_backup_enabled     = true
      + id                               = (known after apply)
      + location                         = "uksouth"
      + name                             = "pip-account-management-staging"
      + public_network_access_enabled    = false
      + resource_group_name              = "pip-account-management-data-staging"
      + sku_name                         = "GP_Gen5_2"
      + ssl_enforcement_enabled          = true
      + ssl_minimal_tls_version_enforced = "TLS1_2"
      + storage_mb                       = 51200
      + tags                             = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
        }
      + version                          = "11"
    }

  # module.database[0].azurerm_private_endpoint.postgres[0] will be created
  + resource "azurerm_private_endpoint" "postgres" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "pip-staging-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "pip-account-management-data-staging"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/iaas"
      + tags                     = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "postgres-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "pip-staging-db"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "postgresqlServer",
            ]
        }
    }

  # module.database[0].azurerm_resource_group.data-resourcegroup will be created
  + resource "azurerm_resource_group" "data-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "pip-account-management-data-staging"
      + tags     = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-account-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
        }
    }

  # module.database[0].null_resource.set-user-permissions[0] will be created
  + resource "null_resource" "set-user-permissions" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS SDS DB Access Reader"
          + "name"           = "pip-account-management"
          + "script_hash"    = "f6e30acec7d742bb8de09d51ea3724cedb22a597c641336ed4f8aecd58283229"
        }
    }

  # module.database[0].random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 7 to add, 16 to change, 7 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":371,"Program":"tfcmt","SHA1":"","Vars":{}} -->